WebappProyecto/app/Controllers/User.php

    public function list()
    {
        $userModel = new \App\Models\UserModel();
        $data['users'] = $userModel->findAll();
---
SELECT *
FROM `user`