WebappProyecto/app/Controllers/Vivienda.php

SELECT *
FROM `vivienda`
SELECT *
FROM `user`
SELECT *
FROM `zona`
---
    public function viewInicio() {
        $viviendaModel = new \App\Models\ViviendaModel();
        $userModel = new \App\Models\UserModel();
        $zonaModel = new \App\Models\ZonaModel();

        $dataVivienda['viviendas'] = $viviendaModel->findAll();
        $dataUser['user'] = $userModel->findAll();
        $dataZona['zona'] = $zonaModel->findAll();

SELECT *
FROM `vivienda`
---
    public function viewOfertas() {
        $viviendaModel = new \App\Models\ViviendaModel();
        $userModel = new \App\Models\UserModel();
        $zonaModel = new \App\Models\ZonaModel();

        $dataVivienda['viviendas'] = $viviendaModel->findAll();